//22. Принципы наследования в объектно - ориентированном программировании.

Наследование является одним из основополагающих принципов ООП.В соответствии с ним, класс может использовать переменные и методы другого класса как свои собственные.


Класс, который наследует данные, называется подклассом(subclass), производным классом(derived class) или дочерним классом(child).Класс, от которого наследуются данные или методы, называется суперклассом(super class), базовым классом(base class) или родительским классом(parent).Термины “родительский” и “дочерний” чрезвычайно полезны для понимания наследования.Как ребенок получает характеристики своих родителей, производный класс получает методы и переменные базового класса.


Наследование полезно, поскольку оно позволяет структурировать и повторно использовать код, что, в свою очередь, может значительно ускорить процесс разработки.