//10. Деревья как динамическая структура данных.Основные определения, связанные с
//понятием дерева : корень, потомки, лист, степень дерева, глубина элемента и дерева
//в целом.Связь между количеством элементов в дереве, его степенью и глубиной.

//Деревом типа T называется множество данных типа T, которое либо пусто, либо
//cодержит один элемент типа T  и связанное с  ним конечное число деревьев.Если дерево не пусто,
//то упомянутый элемент называется корнем дерева, а связанные с ним деревья – его поддеревьями.
//Поддеревья называются также потомками корня, и корень – их предком.
//
//Дополнительные понятия :
//Вершина дерева – корень дерева.
//Степень дерева – максимальное количество потомков у его элементов.
//Лист – элемент, не имеющий потомков(потомки – пустые деревья).
//Глубина(высота) элемента – целое положительное число :
//глубина корня равна 1,
//глубина корней поддеревьев элемента на 1 больше глубины самого элемента.
//Глубина(высота) дерева – наибольшее значение глубин его элементов.
