//25. Потоковые классы в С++.Стандартные потоки cin и cout.Использование
//манипуляторов для форматирования данных при вводе - выводе.

Потоковые классы в С++.
Библиотека потоковых классов С++ построена на основе двух базовых классов : ios и streambuf .

Класс streambuf обеспечивает организацию и взаимосвязь буферов ввода - вывода, размещаемых в памяти, с физическими устройствами ввода - вывода.Методы и данные класса streambuf программист явно обычно не использует.Этот класс нужен другим классам библиотеки ввода - вывода.



Стандартные потоки(istream, ostream, iostream) служат для работы с терминалом.Строковые потоки(istrstream, ostrstream, strstream) служат для ввода - вывода из строковых буферов, размещенных в памяти.Файловые потоки(ifstream, ofstream, fstream) служат для работы с файлами.

ios базовый потоковый класс

Следующие объекты - потоки заранее определены и открыты в программе перед вызовом функции main :

extern istream cin;  // Стандартный поток ввода с клавиатуры
extern ostream cout; // Стандартный поток вывода на экран



Манипулятор = !!endl!! и другие (cout << endl)
Использование манипуляторов
Система ввода / вывода С++ включает второй способ изменения параметров форматирования по­тока.Для этого используются специальные функции, называемые манипуляторами(manipulators), которые могут включаться в выражения ввода / вывода.Стандартные манипуляторы

dec	Ввод / вывод данных в десятичной форме	ввод и вывод
//endl	Вывод символа новой строки с передачей в поток всех данных из буфера	вывод
ends	Вывод нулевого символа	вывод
flush	Передача в поток содержи­мого буфера	вывод
hex	Ввод / вывод данных в шест­надцатиричной системе	ввод и вывод
oct	Ввод / вывод данных в восьме­ричной форме	ввод и вывод
resetiosflags(long f)	Сбрасывает флаги, указанные в f	ввод и вывод
setbase(int base)	Устанавливает базу счисле­ния равной параметру base	вывод
setfill(int ch)	Устанавливает символ заполнения равным ch	вывод
setiosflags(long f)	Устанавливает флаги, указанные в f	ввод и вывод
setprecision(int p)	Устанавливает число цифр после запятой	вывод
setw(int w)	Устанавливает ширину поля равной w	вывод
ws	Пропускает начальный символ - разделитель	ввод