#include <iostream>
using namespace std;

int main()
{
	int n;
	cin >> n;
	int arr1[n], arr2[n];
	int *ptr_arr1 = arr1, *ptr_arr2 = arr2;

	for (int i = 0; i < n; ++i)
	{
		// РѕРїРµСЂР°С‚РѕСЂРѕРј СЂР°Р·С‹РјРµРЅРѕРІС‹РІР°РЅРёСЏ * Рё Р°СЂРёС„РјРµС‚РёРєРѕР№ СѓРєР°Р·Р°С‚РµР»РµР№ РїСЂРѕРґРІРёРіР°РµРјСЃСЏ РїРѕ РјР°СЃСЃРёРІСѓ 
		*(ptr_arr1 + i) = i + 1;
		// РїСЂРёСЃРІР°РёРІР°РµРј Р·РЅР°С‡РµРЅРёРµ РїРµСЂРІРѕРіРѕ РјР°СЃСЃРёРІР° РІРѕ РІС‚РѕСЂРѕР№ <=>
		// РїСЂРѕРґРІРёРіР°РµРјСЃСЏ РІ РѕР±СЂР°С‚РЅРѕРј РїРѕСЂСЏРґРєРµ = РїСЂРѕРґРІРёРіР°РµРјСЃСЏ РІ РїСЂСЏРјРѕРј РїРѕСЂСЏРґРєРµ
		*(ptr_arr2 + n - 1 - i) = *(ptr_arr1 + i);
	}
	for (int i = 0; i < n; ++i)
	{
		// cout << arr2[i] << " ";
		cout << *(ptr_arr2 + i) << " ";
	}

	system("pause");
}