//3. Стек как динамическая структура.Логическое описание стека.

// 
//Стек — динамическая структура данных, представляющая из себя упорядоченный набор элементов, в которой добавление новых элементов и удаление существующих производится с одного конца, называемого вершиной стека.
//
//По определению, элементы извлекаются из стека в порядке, обратном их добавлению в эту структуру, т.е.действует принцип "последний пришёл — первый ушёл".


//Ниже приведена реализация стека на C++, которая охватывает следующие операции :
//
//push: Вставляет новый элемент на вершину стека, над его текущим верхним элементом.
//pop : Удаляет верхний элемент стека, тем самым уменьшая его размер на единицу.
//isEmpty : Возвращает true, если стек пуст, т.е.его размер равен нулю; в противном случае возвращается false.
//isFull: Возвращает true, если стек полон, т.е.его размер достиг максимальной выделенной емкости; в противном случае возвращает false.
//peek: Возвращает верхний элемент, присутствующий в стеке, без модификации стека.
//size : Возвращает количество элементов, присутствующих в стеке.
