// 1. Оператор описания типа. Примеры использования.


//+ Добавляет два операнда	A + B даст 30
//- Вычитает второй операнд с первого	A - B даст - 10
//* Умножает оба операнда	A * B даст 200
/// Делит числитель на де - числитель	B / A даст 2
//% Оператор модуля и остаток после целочисленного деления	B % A даст 0
//++Оператор приращения увеличивает целочисленное значение на единицу	A ++ даст 11 
//- Уменьшает целочисленное значение на единицу	A-- даст 9

// ??????
//int — целочисленный тип данных.
//float — тип данных с плавающей запятой.
//double — тип данных с плавающей запятой двойной точности.
//char — символьный тип данных.
//bool — логический тип данных.

//int a; // объявление переменной a целого типа. 
//float b; // объявление переменной b типа данных с плавающей запятой. 
//double c = 14.2; // инициализация переменной типа double. 
//char d = 's'; // инициализация переменной типа char. 
//bool k = true; // инициализация логической переменной k.