////12. Двоичные деревья.Обходы двоичных деревьев.Двоичные деревья поиска –
////определение.
//
//Двоичное(бинарное) дерево – это дерево степени 2. Между его поддеревьями
//устанавливается порядок : одно из поддеревьев считается левым поддеревом,
//другое – правым поддеревом.
//Для двоичного дерева должны быть выполнимы операции, общие для всех деревьев.
//Дополнительные операции :
//6. Перейти к левому поддереву.Исходные данные – дерево.Результат – дерево, являющееся левым     поддеревом корня.
//7. Перейти к правому поддереву.Исходные данные – дерево.Результат – дерево, являющееся правым     поддеревом корня.
//
//
//Для двоичного дерева допустимы следующие варианты обходов.
//
//Прямой обход двоичного дерева : !!!PREorder 
//Этот обход можно назвать КЛП обходом(корень – левое поддерево – правое поддерево).
//
//Обратный обход двоичного дерева(ЛПК, ПЛК) :Postorder 
//
//Для двоичного дерева возможен также «внутренний» обход(ЛКП, ПКЛ) INorder
//
//
//Определение.Двоичное дерево называется деревом поиска, если для каждого его элемента
//выполняются условия :
//1) все элементы его левого поддерева меньше самого элемента,
//2) все элементы его правого поддерева больше своего предка.