//23. Понятие виртуальных методов класса.

Виртуальный метод(виртуальная функция) — это метод класса, который может быть переопределён в классах - наследниках так, что конкретная реализация метода для вызова будет определяться во время исполнения.

Виртуальные методы — один из важнейших приёмов реализации полиморфизма.Они позволяют создавать общий код, который может работать как с объектами базового класса, так и с объектами любого его класса - наследника.

Объект класса, в котором есть такое, не может быть создан напрямую, только как подобъект в классе - наследнике.Такой класс нельзя использовать в объявлениях объектов, но можно в объявлениях указателей на них и в списках базовых классов других классов.

Класс, который содержит хотя бы один чисто виртуальный метод называется абстрактным.Нельзя создавать объекты абстрактного класса.