////11. Обходы деревьев и их разновидности.
//
//Деревья можно обходить «в глубину» или «в ширину».
//
//Существует три основных способа обхода «в глубину»:
//прямой(pre - order)
//центрированный(in - order)
//обратный(post - order)[1].Кроме этих трёх основных схем, возможны более сложные гибридные схемы, такие как алгоритмы поиска с ограниченной глубиной[en], подобные поиску в глубину с итеративным углублением[en].
//
//Поиск в ширину
//Деревья можно обходить также в порядке уровней, где мы посещаем каждый узел на уровне прежде чем перейти на следующий уровень.Такой поиск называется поиском в ширину(breadth - first search, BFS).