//2. Понятие динамической структуры данных.
// Логический и физический уровни описания динамических структур.


//Динамические структуры данных
//Переменные типа «указатель» обычно используют при реализации динамических переменных, в том числе и динамических структур данных.
//
//Динамические структуры данных могут быть организованы линейно, в виде дерева и в виде сети.
//
//Линейная динамическая структура представляет собой изменяемую последовательность элементов.Частными случаями таких структур являются :
//
//• стеки, в которых разрешено добавлять элементы только в конец и удалять только последние элементы
//• очереди, в которых добавление элементов осуществляется в конец, а удаление — из начала
//• Однонаправленный список
//• Бинарное дерево


//Логический уровень описания (формализованное/ модельное описание) – представление динамических структур абстрактно, описание устно, блок схемой
//Физический уровень – отображение на память ЭВМ информационного объекта в соответствии с логическим описанием.НАписание на языке программирования - например c++
