//16. Основные принципы объектно - ориентированного программирования.Структура
//описания класса в языке С++.Уровни доступа к полям и методам объектов.



В ООП существует три основных принципа построения классов :

Инкапсуляция — это свойство, позволяющее объединить в классе и данные, и методы, работающие с ними и скрыть детали реализации от пользователя.
Наследование — это свойство, позволяющее создать новый класс - потомок на основе уже существующего, при этом все характеристики класса родителя присваиваются классу - потомку.
Полиморфизм — свойство классов, позволяющее использовать объекты классов с одинаковым интерфейсом без информации о типе и внутренней структуре объекта.

выделяют также 4 принцип (Абстракция — отделение концепции от ее экземпляра;)


// объявление классов в С++
class /*имя класса*/
{
	//уровни доступа private, public, protected
private:
	/* список свойств и методов для использования внутри класса */
public:
	/* список методов доступных другим функциям и объектам программы */
protected:
	/*список средств, доступных при наследовании*/
};