
// Дано двузначное число. Найдите число десятков в нем.


#include <iostream>
using namespace std;

int main() {

	int Num;
	cin >> Num;
	cout << Num / 10;

	return 0;
}