// РџРёСЂРѕР¶РѕРє РІ СЃС‚РѕР»РѕРІРѕР№ СЃС‚РѕРёС‚ a СЂСѓР±Р»РµР№ Рё b РєРѕРїРµРµРє. РћРїСЂРµРґРµР»РёС‚Рµ, СЃРєРѕР»СЊРєРѕ СЂСѓР±Р»РµР№ Рё РєРѕРїРµРµРє РЅСѓР¶РЅРѕ Р·Р°РїР»Р°С‚РёС‚СЊ Р·Р° n РїРёСЂРѕР¶РєРѕРІ.

// Р’С…РѕРґРЅС‹Рµ РґР°РЅРЅС‹Рµ
// РџСЂРѕРіСЂР°РјРјР° РїРѕР»СѓС‡Р°РµС‚ РЅР° РІС…РѕРґ С‚СЂРё С‡РёСЃР»Р°: a, b, n.

// Р’С‹С…РѕРґРЅС‹Рµ РґР°РЅРЅС‹Рµ
// РџСЂРѕРіСЂР°РјРјР° РґРѕР»Р¶РЅР° РІС‹РІРµСЃС‚Рё РґРІР° С‡РёСЃР»Р°: СЃС‚РѕРёРјРѕСЃС‚СЊ РїРѕРєСѓРїРєРё РІ СЂСѓР±Р»СЏС… Рё РєРѕРїРµР№РєР°С….


#include <iostream>
#include <cmath>
#include <math.h>
using namespace std;

int main() {

	int a, b, n;

	cin >> a >> b >> n;

	a *= 100;
	n *= (a + b);
	a = n / 100;
	b = n % 100;

	cout << a << " " << b;


	return 0;
}