// Р”Р°РЅС‹ Р·РЅР°С‡РµРЅРёСЏ РґРІСѓС… РјРѕРјРµРЅС‚РѕРІ РІСЂРµРјРµРЅРё, РїСЂРёРЅР°РґР»РµР¶Р°С‰РёС… РѕРґРЅРёРј Рё С‚РµРј Р¶Рµ СЃСѓС‚РєР°Рј: С‡Р°СЃС‹, РјРёРЅСѓС‚С‹ Рё СЃРµРєСѓРЅРґС‹ РґР»СЏ РєР°Р¶РґРѕРіРѕ РёР· РјРѕРјРµРЅС‚РѕРІ РІСЂРµРјРµРЅРё. РР·РІРµСЃС‚РЅРѕ, С‡С‚Рѕ РІС‚РѕСЂРѕР№ РјРѕРјРµРЅС‚ РІСЂРµРјРµРЅРё РЅР°СЃС‚СѓРїРёР» РЅРµ СЂР°РЅСЊС€Рµ РїРµСЂРІРѕРіРѕ. РћРїСЂРµРґРµР»РёС‚Рµ, СЃРєРѕР»СЊРєРѕ СЃРµРєСѓРЅРґ РїСЂРѕС€Р»Рѕ РјРµР¶РґСѓ РґРІСѓРјСЏ РјРѕРјРµРЅС‚Р°РјРё РІСЂРµРјРµРЅРё.

// Р’С…РѕРґРЅС‹Рµ РґР°РЅРЅС‹Рµ
// РџСЂРѕРіСЂР°РјРјР° РЅР° РІС…РѕРґ РїРѕР»СѓС‡Р°РµС‚ С‚СЂРё С†РµР»С‹С… С‡РёСЃР»Р° вЂ” С‡Р°СЃС‹, РјРёРЅСѓС‚С‹, СЃРµРєСѓРЅРґС‹, Р·Р°РґР°СЋС‰РёРµ РїРµСЂРІС‹Р№ РјРѕРјРµРЅС‚ РІСЂРµРјРµРЅРё Рё С‚СЂРё С†РµР»С‹С… С‡РёСЃР»Р°, Р·Р°РґР°СЋС‰РёС… РІС‚РѕСЂРѕР№ РјРѕРјРµРЅС‚ РІСЂРµРјРµРЅРё.

// Р’С‹С…РѕРґРЅС‹Рµ РґР°РЅРЅС‹Рµ
// Р’С‹РІРµРґРёС‚Рµ С‡РёСЃР»Рѕ СЃРµРєСѓРЅРґ РјРµР¶РґСѓ СЌС‚РёРјРё РјРѕРјРµРЅС‚Р°РјРё РІСЂРµРјРµРЅРё.

#include <iostream>
#include <cmath>
#include <math.h>
using namespace std;

int main() {

	int h, m, s, h1, m1, s1;

	cin >> h >> m >> s >> h1 >> m1 >> s1;

	h *= 3600;
	m *= 60;
	s += h + m;

	h1 *= 3600;
	m1 *= 60;
	s1 += h1 + m1;

	s1 -= s;

	cout << s1;

	return 0;
}