/*Р”Р»РёРЅР° РњРѕСЃРєРѕРІСЃРєРѕР№ РєРѕР»СЊС†РµРІРѕР№ Р°РІС‚РѕРјРѕР±РёР»СЊРЅРѕР№ РґРѕСЂРѕРіРё вЂ”109 РєРёР»РѕРјРµС‚СЂРѕРІ. Р‘Р°Р№РєРµСЂ Р’Р°СЃСЏ СЃС‚Р°СЂС‚СѓРµС‚ СЃ РЅСѓР»РµРІРѕРіРѕ РєРёР»РѕРјРµС‚СЂР° РњРљРђР” Рё РµРґРµС‚ СЃРѕ СЃРєРѕСЂРѕСЃС‚СЊСЋ v РєРёР»РѕРјРµС‚СЂРѕРІ РІ С‡Р°СЃ. РќР° РєР°РєРѕР№ РѕС‚РјРµС‚РєРµ РѕРЅ РѕСЃС‚Р°РЅРѕРІРёС‚СЃСЏ С‡РµСЂРµР· t С‡Р°СЃРѕРІ?*/


#include <iostream>
#include <cmath>
#include <math.h>
using namespace std;

int main(){
   int v, t;
   int s = 109;
   cin >> v >> t;
   cout << (s + (v * t % s)) % s;
   return 0;
}
