// n С€РєРѕР»СЊРЅРёРєРѕРІ РґРµР»СЏС‚ k СЏР±Р»РѕРє вЂњРїРѕСЂРѕРІРЅСѓвЂќ, С‚Рѕ РµСЃС‚СЊ С‚Р°Рє, С‡С‚РѕР±С‹ РєРѕР»РёС‡РµСЃС‚РІРѕ СЏР±Р»РѕРє, РґРѕСЃС‚Р°РІС€РёС…СЃСЏ Р»СЋР±С‹Рј РґРІСѓРј С€РєРѕР»СЊРЅРёРєР°Рј, РѕС‚Р»РёС‡Р°Р»РѕСЃСЊ Р±С‹ РЅРµ Р±РѕР»РµРµ, С‡РµРј РЅР° 1.

// Р’С…РѕРґРЅС‹Рµ РґР°РЅРЅС‹Рµ
// РџСЂРѕРіСЂР°РјРјР° РїРѕР»СѓС‡Р°РµС‚ РЅР° РІС…РѕРґ С‡РёСЃР»Р° n Рё k.

// Р’С‹С…РѕРґРЅС‹Рµ РґР°РЅРЅС‹Рµ
// РџСЂРѕРіСЂР°РјРјР° РґРѕР»Р¶РЅР° РІС‹РІРµСЃС‚Рё РєРѕР»РёС‡РµСЃС‚РІРѕ С€РєРѕР»СЊРЅРёРєРѕРІ, РєРѕС‚РѕСЂС‹Рј РґРѕСЃС‚Р°РЅРµС‚СЃСЏ СЏР±Р»РѕРє РјРµРЅСЊС€Рµ, С‡РµРј РЅРµРєРѕС‚РѕСЂС‹Рј РёР· РёС… С‚РѕРІР°СЂРёС‰РµР№.

// РџСЂРёРјРµС‡Р°РЅРёРµ
// РџСЂРё СЂРµС€РµРЅРёРё СЌС‚РѕР№ Р·Р°РґР°С‡Рё РЅРµР»СЊР·СЏ РїРѕР»СЊР·РѕРІР°С‚СЊСЃСЏ СѓСЃР»РѕРІРЅРѕР№ РёРЅСЃС‚СЂСѓРєС†РёРµР№ if Рё С†РёРєР»Р°РјРё.


#include <iostream>
#include <cmath>
#include <math.h>
using namespace std;

int main() {
	int k, n;
	cin >> n >> k;

	k = (n - k % n) % n;

	cout << k;

	return 0;
}