// За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров?

// При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.

// Входные данные
// Программа получает на вход числа n и m.

// Выходные данные
// Выведите ответ на задачу.


#include <iostream>
#include <cmath>
#include <math.h>
using namespace std;

int main() {
	double n, m, d;
	cin >> n >> m;

	d = m / n;
	d = ceil(d);

	cout << d;

	return 0;
}