// Р—Р° РґРµРЅСЊ РјР°С€РёРЅР° РїСЂРѕРµР·Р¶Р°РµС‚ n РєРёР»РѕРјРµС‚СЂРѕРІ. РЎРєРѕР»СЊРєРѕ РґРЅРµР№ РЅСѓР¶РЅРѕ, С‡С‚РѕР±С‹ РїСЂРѕРµС…Р°С‚СЊ РјР°СЂС€СЂСѓС‚ РґР»РёРЅРѕР№ m РєРёР»РѕРјРµС‚СЂРѕРІ?

// РџСЂРё СЂРµС€РµРЅРёРё СЌС‚РѕР№ Р·Р°РґР°С‡Рё РЅРµР»СЊР·СЏ РїРѕР»СЊР·РѕРІР°С‚СЊСЃСЏ СѓСЃР»РѕРІРЅРѕР№ РёРЅСЃС‚СЂСѓРєС†РёРµР№ if Рё С†РёРєР»Р°РјРё.

// Р’С…РѕРґРЅС‹Рµ РґР°РЅРЅС‹Рµ
// РџСЂРѕРіСЂР°РјРјР° РїРѕР»СѓС‡Р°РµС‚ РЅР° РІС…РѕРґ С‡РёСЃР»Р° n Рё m.

// Р’С‹С…РѕРґРЅС‹Рµ РґР°РЅРЅС‹Рµ
// Р’С‹РІРµРґРёС‚Рµ РѕС‚РІРµС‚ РЅР° Р·Р°РґР°С‡Сѓ.


#include <iostream>
#include <cmath>
#include <math.h>
using namespace std;

int main() {
	double n, m, d;
	cin >> n >> m;

	d = m / n;
	d = ceil(d);

	cout << d;

	return 0;
}