// Р”Р°РЅРѕ С‡РёСЃР»Рѕ n. РЎ РЅР°С‡Р°Р»Р° СЃСѓС‚РѕРє РїСЂРѕС€Р»Рѕ n РјРёРЅСѓС‚. РћРїСЂРµРґРµР»РёС‚Рµ, СЃРєРѕР»СЊРєРѕ С‡Р°СЃРѕРІ Рё РјРёРЅСѓС‚ Р±СѓРґСѓС‚ РїРѕРєР°Р·С‹РІР°С‚СЊ СЌР»РµРєС‚СЂРѕРЅРЅС‹Рµ С‡Р°СЃС‹ РІ СЌС‚РѕС‚ РјРѕРјРµРЅС‚. РџСЂРѕРіСЂР°РјРјР° РґРѕР»Р¶РЅР° РІС‹РІРµСЃС‚Рё РґРІР° С‡РёСЃР»Р°: РєРѕР»РёС‡РµСЃС‚РІРѕ С‡Р°СЃРѕРІ (РѕС‚ 0 РґРѕ 23) Рё РєРѕР»РёС‡РµСЃС‚РІРѕ РјРёРЅСѓС‚ (РѕС‚ 0 РґРѕ 59). РЈС‡С‚РёС‚Рµ, С‡С‚Рѕ С‡РёСЃР»Рѕ n РјРѕР¶РµС‚ Р±С‹С‚СЊ Р±РѕР»СЊС€Рµ, С‡РµРј РєРѕР»РёС‡РµСЃС‚РІРѕ РјРёРЅСѓС‚ РІ СЃСѓС‚РєР°С….

#include <iostream>
#include <cmath>
#include <math.h>
using namespace std;

int main() {

	int n;
	cin >> n;

	// 1 h = 60 m
	cout << n / 60 % 24 << " " << n % 60;

	return 0;
}