// РЈР»РёС‚РєР° РїРѕР»Р·С‘С‚ РїРѕ РІРµСЂС‚РёРєР°Р»СЊРЅРѕРјСѓ С€РµСЃС‚Сѓ РІС‹СЃРѕС‚РѕР№ h РјРµС‚СЂРѕРІ, РїРѕРґРЅРёРјР°СЏСЃСЊ Р·Р° РґРµРЅСЊ РЅР° a РјРµС‚СЂРѕРІ, Р° Р·Р° РЅРѕС‡СЊ СЃРїСѓСЃРєР°СЏСЃСЊ РЅР° b РјРµС‚СЂРѕРІ. РќР° РєР°РєРѕР№ РґРµРЅСЊ СѓР»РёС‚РєР° РґРѕРїРѕР»Р·С‘С‚ РґРѕ РІРµСЂС€РёРЅС‹ С€РµСЃС‚Р°?

// Р’С…РѕРґРЅС‹Рµ РґР°РЅРЅС‹Рµ
// РџСЂРѕРіСЂР°РјРјР° РїРѕР»СѓС‡Р°РµС‚ РЅР° РІС…РѕРґ РЅР°С‚СѓСЂР°Р»СЊРЅС‹Рµ С‡РёСЃР»Р° h, a, b. Р“Р°СЂР°РЅС‚РёСЂСѓРµС‚СЃСЏ, С‡С‚Рѕ a>b.

// Р’С‹С…РѕРґРЅС‹Рµ РґР°РЅРЅС‹Рµ
// РџСЂРѕРіСЂР°РјРјР° РґРѕР»Р¶РЅР° РІС‹РІРµСЃС‚Рё РѕРґРЅРѕ РЅР°С‚СѓСЂР°Р»СЊРЅРѕРµ С‡РёСЃР»Рѕ.

// РџСЂРёРјРµС‡Р°РЅРёРµ
// РџСЂРё СЂРµС€РµРЅРёРё СЌС‚РѕР№ Р·Р°РґР°С‡Рё РЅРµР»СЊР·СЏ РїРѕР»СЊР·РѕРІР°С‚СЊСЃСЏ СѓСЃР»РѕРІРЅРѕР№ РёРЅСЃС‚СЂСѓРєС†РёРµР№ if Рё С†РёРєР»Р°РјРё.


#include <iostream>
#include <cmath>
#include <math.h>
using namespace std;

int main() {

	int h, a, b, d;

	cin >> h >> a >> b;

	d = h / (a - b) - h % (a - b);

	cout << d;

	return 0;
}