// Р­Р»РµРєС‚СЂРѕРЅРЅС‹Рµ С‡Р°СЃС‹ РїРѕРєР°Р·С‹РІР°СЋС‚ РІСЂРµРјСЏ РІ С„РѕСЂРјР°С‚Рµ h:mm:ss, С‚Рѕ РµСЃС‚СЊ СЃРЅР°С‡Р°Р»Р° Р·Р°РїРёСЃС‹РІР°РµС‚СЃСЏ РєРѕР»РёС‡РµСЃС‚РІРѕ С‡Р°СЃРѕРІ, РїРѕС‚РѕРј РѕР±СЏР·Р°С‚РµР»СЊРЅРѕ РґРІСѓР·РЅР°С‡РЅРѕРµ РєРѕР»РёС‡РµСЃС‚РІРѕ РјРёРЅСѓС‚, Р·Р°С‚РµРј РѕР±СЏР·Р°С‚РµР»СЊРЅРѕ РґРІСѓР·РЅР°С‡РЅРѕРµ РєРѕР»РёС‡РµСЃС‚РІРѕ СЃРµРєСѓРЅРґ. РљРѕР»РёС‡РµСЃС‚РІРѕ РјРёРЅСѓС‚ Рё СЃРµРєСѓРЅРґ РїСЂРё РЅРµРѕР±С…РѕРґРёРјРѕСЃС‚Рё РґРѕРїРѕР»РЅСЏСЋС‚СЃСЏ РґРѕ РґРІСѓР·РЅР°С‡РЅРѕРіРѕ С‡РёСЃР»Р° РЅСѓР»СЏРјРё.

#include <iostream>
#include <iomanip>
#include <cmath>
#include <math.h>
using namespace std;

int main() {

	int n;
	cin >> n;

	// 1 h = 60 m = 3600 s
	// 1 m = 60 s
	// cout << n / 3600 % 24 << ":" << n / 60 % 60 << ":" << n % 60;

	cout << n / 3600 % 24 << ":" << setw(2) << setfill('0') << n / 60 % 60 << ":" << setw(2) << setfill('0') << n % 60;

	return 0;
}