// Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, минуты и секунды для каждого из моментов времени. Известно, что второй момент времени наступил не раньше первого. Определите, сколько секунд прошло между двумя моментами времени.

// Входные данные
// Программа на вход получает три целых числа — часы, минуты, секунды, задающие первый момент времени и три целых числа, задающих второй момент времени.

// Выходные данные
// Выведите число секунд между этими моментами времени.

#include <iostream>
#include <cmath>
#include <math.h>
using namespace std;

int main() {

	int h, m, s, h1, m1, s1;

	cin >> h >> m >> s >> h1 >> m1 >> s1;

	h *= 3600;
	m *= 60;
	s += h + m;

	h1 *= 3600;
	m1 *= 60;
	s1 += h1 + m1;

	s1 -= s;

	cout << s1;

	return 0;
}