// Электронные часы показывают время в формате h:mm:ss, то есть сначала записывается количество часов, потом обязательно двузначное количество минут, затем обязательно двузначное количество секунд. Количество минут и секунд при необходимости дополняются до двузначного числа нулями.

#include <iostream>
#include <iomanip>
#include <cmath>
#include <math.h>
using namespace std;

int main() {

	int n;
	cin >> n;

	// 1 h = 60 m = 3600 s
	// 1 m = 60 s
	// cout << n / 3600 % 24 << ":" << n / 60 % 60 << ":" << n % 60;

	cout << n / 3600 % 24 << ":" << setw(2) << setfill('0') << n / 60 % 60 << ":" << setw(2) << setfill('0') << n % 60;

	return 0;
}