// Улитка ползёт по вертикальному шесту высотой h метров, поднимаясь за день на a метров, а за ночь спускаясь на b метров. На какой день улитка доползёт до вершины шеста?

// Входные данные
// Программа получает на вход натуральные числа h, a, b. Гарантируется, что a>b.

// Выходные данные
// Программа должна вывести одно натуральное число.

// Примечание
// При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.


#include <iostream>
#include <cmath>
#include <math.h>
using namespace std;

int main() {

	int h, a, b, d;

	cin >> h >> a >> b;

	d = h / (a - b) - h % (a - b);

	cout << d;

	return 0;
}